
## Plan Result (stg)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 7 to change, 2 to destroy.</code></pre>

* Update
  * azurerm_api_management_subscription.product[0]
  * module.action-group.azurerm_resource_group_template_deployment.action-group
  * module.apim_product[0].azurerm_api_management_product.product
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects_trigger_once
  * module.redis-v6.azurerm_redis_cache.redis
  * module.sa.azurerm_storage_account.storage_account
* Delete
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;cath-mi-id&#34;]
* Replace
  * azurerm_key_vault_secret.cath_mi_client_id[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.product[0] will be updated in-place
  ~ resource "azurerm_api_management_subscription" "product" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/subscriptions/d5a0ba59-f5ac-4e05-9650-2e5734c17e29"
        # (10 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.cath_mi_client_id[0] must be replaced
-/+ resource "azurerm_key_vault_secret" "cath_mi_client_id" {
      ~ id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/cath-mi-id/a394a315a6f14f3bbdbce5d6ff602d0f" -> (known after apply)
      ~ name                    = "cath-mi-id" -> "cath-mi-client-id" # forces replacement
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg/secrets/cath-mi-id/versions/a394a315a6f14f3bbdbce5d6ff602d0f" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg/secrets/cath-mi-id" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "a394a315a6f14f3bbdbce5d6ff602d0f" -> (known after apply)
      ~ versionless_id          = "https://pip-ss-kv-stg.vault.azure.net/secrets/cath-mi-id" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Resources/deployments/CaTH-Group"
        name                     = "CaTH-Group"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.apim_product[0].azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/pip-product-stg"
      ~ subscriptions_limit   = 0 -> 20
        # (9 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/schedules/rotate-client-secrets-schedule"
        name                    = "rotate-client-secrets-schedule"
      ~ start_time              = "2026-02-14T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects_trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects_trigger_once" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/schedules/rotate-client-secrets-schedule-single-trigger"
        name                    = "rotate-client-secrets-schedule-single-trigger"
      ~ start_time              = "2026-02-13T15:14:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["cath-mi-id"] will be destroyed
  # (because key ["cath-mi-id"] is not in for_each map)
  - resource "azurerm_key_vault_secret" "secret" {
      - expiration_date         = "2026-03-01T01:00:00Z" -> null
      - id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/cath-mi-id/a394a315a6f14f3bbdbce5d6ff602d0f" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg" -> null
      - name                    = "cath-mi-id" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg/secrets/cath-mi-id/versions/a394a315a6f14f3bbdbce5d6ff602d0f" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg/secrets/cath-mi-id" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - value_wo                = (write-only attribute) -> null
      - value_wo_version        = 0 -> null
      - version                 = "a394a315a6f14f3bbdbce5d6ff602d0f" -> null
      - versionless_id          = "https://pip-ss-kv-stg.vault.azure.net/secrets/cath-mi-id" -> null
        # (1 unchanged attribute hidden)
    }

  # module.redis-v6.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-v6-cache-stg/providers/Microsoft.Cache/redis/pip-v6-stg"
        name                               = "pip-v6-stg"
        tags                               = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (24 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved         = 125 -> 200
          ~ maxmemory_delta                         = 125 -> 200
          ~ maxmemory_reserved                      = 125 -> 200
            # (14 unchanged attributes hidden)
        }
    }

  # module.sa.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Storage/storageAccounts/pipsssastg"
        name                               = "pipsssastg"
        tags                               = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (97 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 7 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":259,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->